app/controllers/admin/admin_controller.rb

SELECT "courses".* FROM "courses"
SELECT "departments".* FROM "departments"
SELECT "members".* FROM "members"
---
  def index
    @data = {departments: Department.all, courses: Course.all, members: Member.all}