app/controllers/user/authentication_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."student_id" = ? LIMIT ?  [["student_id", "54285290"], ["LIMIT", 1]]
---
  def login
    redirect_to('/index') if session[:user_id]
    @student_id = params[:student_id]
    if @student_id && (member = Member.find_by(student_id: @student_id))