app/controllers/user/course_controller.rb

  def register
    @data = {}
    if params[:course]
      @data[:course] = Course.find(params.fetch(:course))
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def cancel
    @participation = Participation.find_by!(registered_session_id: params.fetch(:id), participant: @current_user)
    if params[:commit]
      @participation.destroy!
---
SELECT  "participations".* FROM "participations" WHERE "participations"."registered_session_id" = ? AND "participations"."participant_id" = 1 LIMIT ?  [["registered_session_id", 4], ["LIMIT", 1]]
DELETE FROM "participations" WHERE "participations"."id" = ?  [["id", 1]]