app/views/admin/course/form.html.erb

    <%= label_tag('course[required_department_ids]', 'Required Department') %>
    <%= select_tag('course[required_department_ids]', options_from_collection_for_select(Department.all, :id, :short_name, @record.try(:required_department_ids)), multiple: true) %>
---
SELECT "departments".* FROM "departments"